app/views/catalog/_home_text.html.erb

              <span class="input-group-addon for-search-field">
                <label for="search_field" class="sr-only"><%= t('blacklight.search.form.search_field.label') %></label>
---
SELECT "searches".* FROM "searches" WHERE "searches"."id" IN (6, 5, 4, 3)  ORDER BY updated_at desc