app/views/catalog/_previous_next_doc.html.erb


      <%=link_to t('blacklight.search.start_over'), root_path(:lib => $brand), id: 'startOverLink', class: 'btn' %>
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" IN (3, 2, 1) AND "searches"."id" = ?  ORDER BY updated_at desc LIMIT 1  [["id", 3]]