app/views/catalog/show.html.erb

SELECT  "searches".* FROM "searches" WHERE "searches"."id" IN (3, 2, 1) AND "searches"."id" = ?  ORDER BY updated_at desc LIMIT 1  [["id", 3]]
---
  <%= render 'previous_next_doc' %>
  <% @page_title = t('blacklight.search.show.title', :document_title => document_show_html_title, :application_name => application_name).html_safe -%>